# BRepBuilderGeometryId Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BRepBuilderGeometryId Constructor
BRepBuilderGeometryId Class See Also
---
Copy constructor
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public BRepBuilderGeometryId(
	BRepBuilderGeometryId other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As BRepBuilderGeometryId _
)
```

Visual C++
---
```text
public:
BRepBuilderGeometryId(
	BRepBuilderGeometryId^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..BRepBuilderGeometryId
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
BRepBuilderGeometryId Class
Autodesk.Revit.DB Namespace